{
  "backend/main.mo": "Main Motoko actor implementing a social media backend with user profiles, posts, comments, likes, following system, and access control using blob storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Internet Identity authentication, user profiles, follow system, post creation, chronological feed, likes, comments, and search functionality with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, pages, hooks, and styling for the social media application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space for consistent styling across the application.",
  "frontend/index.html": "HTML entry point for the Golax Connect application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, authentication flow, profile setup modal, theme provider, and route definitions for feed, search, profile, and settings pages.",
  "frontend/src/components/CommentItem.tsx": "React component displaying individual comment with author avatar, name, content, timestamp, and clickable navigation to author profile.",
  "frontend/src/components/CommentSection.tsx": "React component managing comment display and submission for posts with collapsible comment list, input form, and loading states.",
  "frontend/src/components/CreatePostForm.tsx": "Form component for creating posts with text content and up to 5 images, handling file uploads by converting them to ExternalBlob format and displaying image previews with removal capability.",
  "frontend/src/components/FollowButton.tsx": "Button component that toggles between follow/unfollow states for a user, displaying appropriate icons and triggering the corresponding mutation hooks.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that includes top navigation, a centered content container, and a footer with attribution to caffeine.ai.",
  "frontend/src/components/LikeButton.tsx": "Button component for liking/unliking posts, showing a heart icon that fills when liked and displaying the total like count.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/PostCard.tsx": "Card component displaying a post with author avatar, content, images in a grid layout, like button, comment count, and a comment section.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time profile setup requiring name and bio, with optional profile picture upload converted to ExternalBlob format.",
  "frontend/src/components/TopNavigation.tsx": "Sticky navigation bar with logo, authenticated navigation links (Feed, Search, Profile, Settings), login button, and responsive mobile menu.",
  "frontend/src/components/UserSearchResultCard.tsx": "Clickable card component displaying user search results with avatar, name, and bio that navigates to the user's profile page.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, posts, comments, follows, likes, and search functionality with optimistic updates and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the app with InternetIdentityProvider and QueryClientProvider.",
  "frontend/src/pages/FeedPage.tsx": "Displays the user's news feed with a post creation form and list of posts from followed users, showing empty state when no posts exist.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile with avatar, bio, stats (posts/followers/following), and their posts list, with edit button for own profile or follow button for others.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "Profile settings page allowing users to upload and change their profile picture with file upload handling and loading states.",
  "frontend/src/pages/SearchPage.tsx": "User search page with debounced search input that queries and displays matching users with loading and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and functions to clear parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings for borders, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting Golax Connect, a social media platform with Internet Identity auth, one-way follows, chronological feeds, posts with images, likes, comments, user search, and profile management features."
}